-- local part = script.Parent

-- Color3 არის ფერის კლასი (data type, მონაცემთა ტიპი), რომელიც გამოიყენება ფერის აღსაწერად
-- ის ფერებს ადგენს წითელი, მწვანე და ლურჯი ფერების კომპონენტთა ინტენსივობით

-- Color3 ობიექტის მნიშვნელობის დასაბრუნებლად გამოიყენება 4 მეთოდი:
-- new, fromRGB, fromHSV, fromHex


-- Color.new მეთოდს გადაეცემა 3 რიცხვითი მნიშვნელობა, 
-- რომელბიც არიან 0-იდან 1-ის ჩათვლით დიაპაზონში
-- პირველი არის წითელი ფერის ინტენსივობის მაჩვენებელი
-- მეორე არის მწვანე ფერის, მესამე არის ლურჯი ფერის მაჩვენებელი

-- part.Color = Color3.new(1, 0.901961, 0.733333)

-- Color.fromRGB მეთოდს გადაეცემა 3 რიცხვითი მნიშვნელობა,
-- 0-იდან 255-ის ჩათვლით დიაპაზონში, ფერების კომპონენტების მიხედვით
-- რიცხვების თანმიმდევრობა იგივეა როგორც Color.new მეთოდში
-- ამასთან დამატებით fromRGB მეთოდის სახელი გამომდინარეობს ფერების
-- პირველი ასოებიდან, R - Red, G - Green, B - Blue,
-- fromRedGreenBlue ანუ ფერს ავღწერთ ამ კომპონენტების საშვალებით

-- part.Color = Color3.fromRGB(150, 50, 50)

--  Color.fromHex მეთოდს გადაეცემა 6 ციფრი 16 სისტემიდან
-- ესეიგი ათობითი სისტემის ციფრებს დამატებული: A, B, C, D, E, F
-- ეს ციფრები დაემატა fromRGB-იდან გამომდინარე, fromRGB და hex
-- მნიშვნელობები ურთიერთშესაბამისია, ერთი ფორმიდან შეგვიძლია გადაყვანა
-- მეორე ფორმატში, დამატებით: Hex - თექვსმეტობითი

-- part.Color = Color3.fromHex("FF00FF")


-- part.Color = Color3.fromHSV(25, 25, 35)



-- while true do
--     local r,g,b = math.random(1,255), math.random(1,255), math.random(1,255)
--     wait(0.2)
--     part.Color = Color3.fromRGB(r,g,b)
-- end


